{
      "retcode": 0,
      "message": "OK",
      "data": {
            "list": [
                  {
                        "ann_id": 1001,
                        "title": "Version 2.7 Update Notice",
                        "subtitle": "Version 2.7 Update Notice",
                        "banner": "https://uploadstatic-sea.mihoyo.com/announcement/2022/05/19/8976863d4190c7d36eeb002d96e2e222_436082052037735933.jpg",
                        "content": "<p style=\"white-space: pre-wrap;\">Dear Travelers,</p><p style=\"white-space: pre-wrap;\">Version 2.7 update maintenance is expected to start at <t class=\"t_gl\">2022/05/31 06:00:00</t> and is expected to be completed within 5 hours. Meanwhile, the duration of Version 2.7 is expected to be 6 weeks, and Version 2.8 is expected to be updated on 2022/07/13.</p><p style=\"white-space: pre-wrap;\">We sincerely apologize for the inconvenience caused by this delay.</p><p style=\"white-space: pre-wrap; min-height: 1.5em;\"></p><p style=\"white-space: pre-wrap;\">The current Character Event Wish, Weapon Event Wish and \"Test Run\" event will end on <t class=\"t_gl\">2022/05/31 05:59:59</t>. The countdown time display on the Wish screen and Events Overview page will also be adjusted. There are no changes to the end times of other in-game events.</p><p style=\"white-space: pre-wrap;\">Maintenance for the Placement Function in the Serenitea Pot will also end after the Version 2.7 update maintenance is complete. Travelers can then resume using this Placement Function.</p><p style=\"white-space: pre-wrap; min-height: 1.5em;\"></p><p style=\"white-space: pre-wrap;\">Once again, we apologize for the delay in this update. Thank you for your continued support and understanding.</p><p style=\"white-space: pre-wrap; min-height: 1.5em;\"></p>",
                        "lang": "en-us"
                  },
                  {
                        "ann_id": 1000,
                        "title": "Genshin Impact - Fair Use Statement",
                        "subtitle": "Fair Use Statement",
                        "banner": "https://uploadstatic-sea.mihoyo.com/announcement/2020/09/17/a200f1d4c84be88961455023b264a0bb_3936625726356517613.jpg",
                        "content": "<p style=\"white-space: pre-wrap;\">To ensure a fair and healthy Genshin Impact gaming environment and offer Travelers a great gaming experience, we would like to remind everyone that the following rules apply to all Travelers at all times:</p><p style=\"white-space: pre-wrap;\"><span style=\"color:rgba(204,146,85,1)\">1) The use of plug-ins, accelerators, and any other third-party tools that affect the fairness of the game is strictly forbidden.</span><br>COGNOSPHERE PTE. LTD. (herein referred to as \"we\") will respond to any such activity by taking measures including but not limited to removal of inappropriately obtained rewards, suspension of accounts, and permanent banning of accounts, with the precise measures to be decided based on the seriousness and number of violations.</p><p style=\"white-space: pre-wrap; min-height: 1.5em;\"> </p><p style=\"white-space: pre-wrap;\"><span style=\"color:rgba(204,146,85,1)\">2) The sale, purchase, or transfer of accounts by any means is strictly forbidden.</span><br>We urge Travelers to protect their personal property and information, ignore any requests for account sharing or trading, and refrain from purchasing accounts on other platforms. Likewise, Travelers are forbidden from sharing or selling their own account.<br>In accordance with Genshin Impact's Terms of Service, we will not be responsible for any personal information leaks or damages resulting from a Traveler's own actions.</p><p style=\"white-space: pre-wrap;\"><a href=\"javascript:miHoYoGameJSSDK.openInBrowser('https://genshin.hoyoverse.com/en/company/terms');\">Genshin Impact's Terms of Service</a></p><p style=\"white-space: pre-wrap; min-height: 1.5em;\"></p><p style=\"white-space: pre-wrap;\"><span style=\"color:rgba(204,146,85,1)\">3) Top-up via non-official channels and third parties is strictly forbidden.</span><br>We will respond to any such activity by taking measures including but not limited to removal of inappropriately obtained rewards, suspension of accounts, and permanent banning of accounts, with the precise measures to be decided based on the seriousness and number of violations.</p><p style=\"white-space: pre-wrap;\">We are committed to guaranteeing the fair gameplay of Genshin Impact and to safeguarding Travelers' in-game assets. As we endeavor to constantly improve Genshin Impact, we wholeheartedly hope that Travelers join us in creating and maintaining a fair and harmonious gaming environment.</p><p style=\"white-space: pre-wrap; min-height: 1.5em;\"> </p>",
                        "lang": "en-us"
                  }
            ]
      }
}